
let tipsArray = ["खाने पीने का सामान और अन्य मूल-भूत आवश्यकता की चीज़ों की जमाखोरी मत कीजिये. कृपया ध्यान रखें कि दुसरे ज़रूरतमंद नागरिकों को उनकी कमी का सामना न करना पड़े!",
"सहृदय बनें! जरूरतमंदों और बुजुर्गों की मदद करें। वे ज्यादा बड़े संकट का सामना कर रहे हैं.",
"विचारशील बनें. ख़रीदारी करते समय याद रखें कि 130 करोड़ साथी नागरिकों के साथ आपको आवश्यक और अनिवार्य सामान बाँट कर चलना हैं.",
"आवश्यक सामान खरीदने के लिए बाहर जा रहे हैं? याद रहे! सोशल दिस्तंसिंग सुनिश्चित कीजियेगा! पंक्ति में किसी भी समय दुसरे खरीददार/दुकानदार/ग्राहक से कम से कम २ मीटर की दूरी बनाए रखें.",
"पहले से प्लान बनाकर रखें. खरीददारी के लिए निकलने से पहले एक मिनट लें, और जांचें कि आपके पास घर में कितना ज़रुरत का सामान रखा है. क्या वाकई बाहर जाना ज़रूरी है? प्लानिंग करने से आपको केवल ज़रूरी और ज़रुरत भर की चीज़ें खरीदने में आसानी होती है.",
"अगले तीन हफ्तों के लिए अपनी आवश्यक जरूरतों की गणना करें और उनके सही इस्तेमाल की योजना बनाएं. ",
"बुजुर्गों को उनके किराने का सामान और अन्य जरूरी सामान लाकर उनकी मदद करें।",
"अपने कर्मचारियों और घरेलू कर्मियों के वेतन में कटौती न करें और उनकी मदद करें. यह समय सच्चे भारतवासी होने का और भाईचारे का जज्बा दिखाने का है.  ",
"लॉक-डाउन मतलब लॉक-डाउन! जब तक बिल्कुल जरूरी न हो, बाहर जाने से बचें. सुरक्षित रहे. ",
"घबराइए मत!❌ ज़रुरत का सामान मिलता रहेगा.✔️",
"सरकार द्वारा आपकी मूल भूत आवश्यकताओं का समयबद्ध तरीके से ध्यान रखा जाएगा. जमाखोरी न करें. ",
"सच्चे भारतीय बनें. सहृदय बनें, विचारशील बनें, और ज़रुरतमंदों की मदद करें. हम अवश्य विजय प्राप्त करेंगे.",
"यदि आपमें कोरोनावायरस के लक्षण नज़र आ रहे हैं और आपको संदेह है कि आप संक्रमित हो चुके हैं, तो तुरंत अपने चिकित्सक से संपर्क करें, या राज्य हेल्पलाइन पर 📞कॉल करें और उनकी मदद लें. ",
"झूठी खबरें, अविश्वसनीय WhatsApp फॉरवर्ड और अफवाहों से सावधान रहे. किसी भी मेसेज/सूचना को बिना उसकी पुष्टि किये आगे ❌न भेजें. ",
"यदि आपके पास कोई चिकित्सा सम्बन्धी प्रश्न हैं, तो अपने राज्य हेल्पलाइन, जिला प्रशासन या विश्वसनीय डॉक्टरों से सांझा करें और जानकारी लें.",
"अपने हाथों को साबुन और पानी से नियमित रूप से धोएं, विशेष रूप से किसी भी प्रकार की खरीददारी करने के बाद. वायरस को खुद से दूर रखें!",
"इस बात का कोई सबूत नहीं है कि गर्मी का मौसम वायरस को रोक पायेगा. लेकिन आप ज़रूर कर सकते हैं! घर पर रहिये, सुरक्षित रहिये!",
"घर पर रहकर चिकित्सकों और चिकित्सा कर्मियों की मदद करें!",
"लॉकडाउन के दौरान बाहर जाने से बचें. संक्रमण की श्रृंखला को तोड़ने में मदद करें.",
"लॉकडाउन के दौरान अपने प्रियजनों को कॉल करें, इस कठिन समय में एक दुसरे का सहारा बनें.",
"वायरस भेदभाव नहीं करता है, फिर आप क्यों करें? भेद भाव न करें, हम सब भारतीय हैं!",
"पूर्वोत्तर भारत के हमारे भाई बहन भी उतने ही भारतीय है जितने आप और हम! इस कठिन समय में सबकी मदद करें! ❤️",
"इस लड़ाई में सक्रिय रूप से साथ देने के लिए अपने स्थानीय एनजीओ और जिला प्रशासन से संपर्क करें",
"यह भी बीत जायेगा. घर पर अपने समय का आनंद लें और अपने परिवार के साथ गुणवत्तापूर्ण समय बिताएं! हालात जल्द ही सामान्य होंगे। ",
"ग़लत और झूठी बातें फैलाने वाले असत्यापित WhatsApp फॉरवर्ड की #कड़ीतोडें! जब तक आप किसी भी मेसेज की पुष्टि नहीं कर लेते, तब तक उसे आगे न बढ़ाएं!"];
let tips = document.getElementById('tips');
setInterval(()=>{
tips.innerText = tipsArray[Math.floor(Math.random()*tipsArray.length)];
},10000)




window.addEventListener('load',()=>{
    requestJSON("https://lkounivCovid19.in/api/latestnotice.json")
                .then((data)=>{
                    let pushContent = ``;
                    data.forEach((notice)=>{
                        console.log(notice)
                        pushContent += `
                        <li>
                            <a href="${notice.link?notice.link:"#"}" rel="noopener noreferrer" target="_blank" class="notice">
                                <div class="notice-heading">
                                    <h5>${notice.source?notice.source:""}</h5>
                                    <span>${notice.date?notice.date:""}</span>
                                </div>
                                <div class="notice-content"><p>${notice.content?notice.content:''}</p></div>
                            </a>
                        </li>
                        `
                    });
                    pushDatatoDOM("notices",pushContent);
                });
},false)